package ru.netology

//    Методы для работы с заметками.
class NoteService() {
    // Создает новую заметку у текущего пользователя.
    fun add() {}

    // Добавляет новый комментарий к заметке.
    fun createComment() {}

    // Удаляет заметку текущего пользователя.
    fun delete() {}

    // Удаляет комментарий к заметке.
    fun deleteComment() {}

    // Редактирует заметку текущего пользователя.
    fun edit() {}

    // Редактирует указанный комментарий у заметки.
    fun editComment() {}

    // Возвращает список заметок, созданных пользователем.
    fun get() {}

    // Возвращает заметку по её id.
    fun getByIdv() {}

    // Возвращает список комментариев к заметке.
    fun getComments() {}

    // Восстанавливает удалённый комментарий.
    fun restoreComment() {}
}